[
  {
    "company": "Front-End Simplified Bootcamp",
    "role": "Student",
    "resps": [
      "Developed front-end websites as part of the course curriculum which sharpened my UI and critical thinking skills with development",
      "Learned back-end frame works, such as firebase, and developed full stack websites that store user data and payments",
      "Showcased expertise in UI implementation towards full stack websites such as my twitter clone, in which I added a completely unique layout vs its original well-known appearance",
      "Mastered React and Next JS alongside advanced css concepts and frameworks such as tailwind",
      "Was able, as part of my courses's final project, to build a full stack website that integrated stripe payments and firebase authentication",
      "Used expertise in my creative skills to add unique touches to the front-end UI of every website I created",
      "Integrated Vercel and Github, all while, making use of the terminal within Linux and VScode to deploy and install needed packages and creating different branches for each feature of a website",
      "Showed unwavering dedication to the bootcamp by constanting asking questions and using problem solving to get ahead and debug websites"
    ],
    "date": "May 2023 - Current"
  },
  {
    "company": "Frontend Simplified",
    "role": "Programming mentor & Tutor",
    "resps": [
      "Designed and implemented personalized learning plans tailored to each student's skill level and learning style.",
      "Conducted weekly coding workshops to cover advanced topics and industry best practices in Frontend development.",
      "Provided constructive feedback and code reviews to help students improve their coding skills and address areas of improvement.",
      "Created and curated a comprehensive set of educational resources, including coding exercises, projects, and documentation, to support the learning process.",
      "Collaborated with other mentors to develop and refine the curriculum, ensuring it stays current with the latest trends and technologies in Frontend development.",
      "Organized and participated in regular one-on-one mentoring sessions to address individual student challenges and provide additional guidance.",
      "Facilitated group discussions and coding challenges to promote a collaborative and engaging learning environment.",
      "Stayed updated on industry advancements and emerging technologies to incorporate relevant and cutting-edge content into the curriculum.",
      "Initiated and managed community-building activities, fostering a sense of camaraderie among students and promoting a positive learning culture.",
      "Monitored and tracked the progress of each student, celebrating milestones and proactively addressing any obstacles to ensure a successful learning journey."
    ],
    "date": "Aug 2021 - Dec 2022"
  }
]
